read_verilog -sv ct_vfmau_ff1_10bit_gold.v
synth -flatten -top ct_vfmau_ff1_10bit
dfflibmap -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
clean
stat -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
write_verilog -noattr ct_vfmau_ff1_10bit_gold.mapped.v
