read_verilog -sv ct_fadd_onehot_sel_h_gold.v
rename ct_fadd_onehot_sel_h gold
read_verilog -sv ct_fadd_onehot_sel_h_gate_candidate.v
rename ct_fadd_onehot_sel_h gate
read_verilog -formal ct_fadd_onehot_sel_h_onehot_miter.sv
prep -top miter
flatten
opt
sat -prove fail 0 -verify
